Revit 2027 API
MEPBuildingConstruction.SetBuildingConstruction Method
Sets the Building Construction of the Project Information.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBuildingConstruction(
	ConstructionType constructionType,
	Construction buildingConstruction
)
Public Sub SetBuildingConstruction (
	constructionType As ConstructionType,
	buildingConstruction As Construction
)
public:
void SetBuildingConstruction(
	ConstructionType constructionType,
	Construction^ buildingConstruction
)
member SetBuildingConstruction :
        constructionType : ConstructionType *
        buildingConstruction : Construction -> unit
Parameters
constructionType ConstructionType
The Construction Type of Building Construction.
buildingConstruction Construction
The Building Construction to be set.
Exceptions
Exception | Condition
ArgumentNullException |  buildingConstruction is NULL.
InvalidOperationException |  Sets construction type to an invalid value. - or - Can not set construction type.
Remarks
This function is used to set the Building Construction of the Project Information.
See Also
Reference
MEPBuildingConstruction Class
Autodesk.Revit.DB.Mechanical Namespace